app/controllers/v1/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("imagekey", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["imagekey", "image6"], ["description", "hahahaha"], ["created_at", "2017-06-06 18:19:29.973608"], ["updated_at", "2017-06-06 18:19:29.973608"], ["user_id", 1]]
---
  def createpost
  	#debugger
  	@user = User.find(params[:user_id])
  	@post = @user.posts.build(permit_post)
  	if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def getuserposts
  	@posts = Post.where(:user_id => params[:user_id])
  	if @posts.any?