app/controllers/v1/users_controller.rb

INSERT INTO "users" ("phoneno", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phoneno", "03316813833"], ["password", "123456"], ["created_at", "2017-05-28 18:19:19.554968"], ["updated_at", "2017-05-28 18:19:19.554968"]]
---
	def create
		@user = User.new(user_params)

		@user.save

INSERT INTO "users" ("phoneno", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phoneno", "03316813834"], ["password", "123456"], ["created_at", "2017-05-29 19:43:27.442013"], ["updated_at", "2017-05-29 19:43:27.442013"]]
---
	def createuser
		@user = User.new(phoneno: params[:phoneno] , password: params[:password])
		if @user.save

SELECT "users".* FROM "users" WHERE "users"."phoneno" = ? AND "users"."password" = ?  [["phoneno", "03316813832"], ["password", "123456"]]
SELECT COUNT(*) FROM "users" WHERE "users"."phoneno" = ? AND "users"."password" = ?  [["phoneno", "03316813834"], ["password", "123456"]]
---
	def checklogin
		@user = User.where(phoneno: params[:phoneno] , password: params[:password])

		if @user.any?

SELECT COUNT(*) FROM "users" WHERE "users"."phoneno" = ?  [["phoneno", "03316813834"]]
---
	def alreadyexist
		@user = User.where(phoneno: params[:phoneno])
		if @user.any?